{
  "backend/main.mo": "Main backend actor defining data types (Session, Channel, Message, Document, PlayerDocument, Sticker, etc.) and including storage and authorization mixins; Message type includes optional gif field for GIF URLs.",
  "backend/migration.mo": "Migration module that transforms old Message records (without gif field) to new Message records (with gif field set to null) for backward compatibility.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features for GIF support: sending GIFs via URL paste, URL validation with feedback, and rendering GIFs as animated images in ChatMessageItem.",
  "frontend-file-summaries.txt": "Summaries of frontend files including App.tsx (main app with auth and routing), LobbyPage, SessionPage, chat components with GIF detection/validation, document editors, hooks for session data and polling, and utility libraries.",
  "frontend/docs/regression-test-plan-player-document-uploads.md": "Comprehensive regression test plan covering player document creation with privacy toggles, file/image uploads, upload button states, error handling, visibility controls, and preview markup rendering.",
  "frontend/index.css": "Global Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for UI components including background, foreground, primary, secondary, muted, accent, destructive, border, and sidebar colors.",
  "frontend/index.html": "HTML entry point with viewport meta tag, early theme initialization script to prevent flash by reading localStorage preferences, and root div for React mounting.",
  "frontend/src/App.tsx": "Main app component with error boundary, PreferencesProvider, Internet Identity authentication flow, user profile setup, session context management with localStorage persistence, lobby/session routing, UI scaling via CSS transform, and startup failure detection.",
  "frontend/src/components/app/AppErrorBoundary.tsx": "React error boundary component that catches application errors and displays a recovery UI with options to reload the page or clear local data and reload.",
  "frontend/src/components/app/StartupFailureScreen.tsx": "Full-screen error component displayed when the application fails to initialize, offering reload and clear-data-and-reload recovery options.",
  "frontend/src/components/chat/ChannelChatView.tsx": "Main chat interface component that handles message display, sending text/images/stickers/GIFs, roll commands, replies, auto-scroll, and integrates sticker picker and management panels.",
  "frontend/src/components/chat/ChatMessageItem.tsx": "Individual chat message component that renders message content, avatars, timestamps, reply threads, images/GIFs/stickers, and handles long-press interactions for message actions.",
  "frontend/src/components/chat/StickerManagementPanel.tsx": "Modal panel with tabs for viewing user's sticker collection and uploading new stickers, with delete functionality for existing stickers.",
  "frontend/src/components/chat/StickerPickerPanel.tsx": "Modal panel that displays a grid of available stickers for users to select and send in chat.",
  "frontend/src/components/chat/StickerUploadArea.tsx": "Drag-and-drop or click-to-upload component that processes image files for sticker creation with visual feedback during processing.",
  "frontend/src/components/communities/CommunityForm.tsx": "Main form component for creating/editing communities with fields for name, description, images, privacy settings, join type, join questions, sub-places, and advanced theme customization.",
  "frontend/src/components/communities/CommunityThemePreview.tsx": "Live preview component that displays a styled community card with theme colors, fonts, images, and a join button to visualize customization choices.",
  "frontend/src/components/communities/CreateCommunityDialog.tsx": "Modal dialog wrapper for community creation that handles form submission, validation, error display, and triggers a callback with the new community ID.",
  "frontend/src/components/communities/fields/AdvancedCustomizationSection.tsx": "Collapsible section for advanced theme customization including primary/accent colors, background presets, font selection, and contrast warnings.",
  "frontend/src/components/communities/fields/CommunityImagePickers.tsx": "Image upload component for cover, icon, and banner images with validation, upload progress tracking, preview display, and remove functionality.",
  "frontend/src/components/communities/fields/JoinQuestionsEditor.tsx": "Editor for adding up to 3 optional custom questions that users must answer when requesting to join a community.",
  "frontend/src/components/communities/fields/SubPlacesEditor.tsx": "Editor for creating 1-5 initial sub-places (sections) within a community, each with a name and type (Chat, Documents, or RPG).",
  "frontend/src/components/docs/DocumentCommentsSection.tsx": "Displays and manages comments on a document, allowing authenticated users to add comments and hosts/authors to delete them. Includes a comment list with author display names, timestamps, and a delete confirmation dialog.",
  "frontend/src/components/docs/DocumentContentPreview.tsx": "Renders document content with embedded file references, displaying images inline and other files as downloadable attachments. Tokenizes content to separate text from file markers and applies markup rendering.",
  "frontend/src/components/docs/DocumentEditorView.tsx": "Full-featured document editor for session documents with content editing, file/image uploads, preview mode toggle, and integrated comments section. Supports file markers, tracks unsaved changes, and restricts editing based on document lock status and host permissions.",
  "frontend/src/components/docs/ImageUploadWithTitleDialog.tsx": "Modal dialog for uploading images with an optional title field. Validates file type and size, pre-fills title from filename, and handles upload with error feedback.",
  "frontend/src/components/docs/PlayerDocumentEditorView.tsx": "Editor for player-owned documents with content editing, visibility toggle (shared with host), file/image uploads, and preview mode. Similar to DocumentEditorView but uses player document hooks and includes visibility control.",
  "frontend/src/components/profile/Avatar.tsx": "Displays a user avatar with fallback to initials if image fails to load or is unavailable. Supports three sizes (sm, md, lg) and generates initials from the user's name.",
  "frontend/src/components/profile/ProfilePictureSection.tsx": "Profile picture upload component with preview, remove functionality, and upload progress display. Validates image files (PNG/JPG, max 5MB) and shows current or preview avatar.",
  "frontend/src/components/profile/QuickChatProfileDialog.tsx": "Dialog component for setting a quick chat profile with display name and avatar image upload, stored locally with validation for file type and size (5MB max).",
  "frontend/src/components/session/ChannelManagementDialogs.tsx": "Provides dialogs for creating, renaming, and deleting channels within a session, with controlled/uncontrolled open state support and error handling.",
  "frontend/src/components/session/DocumentManagementDialogs.tsx": "Manages document operations (create, rename, delete, lock/unlock) through dialogs, with support for initial content and callbacks on document creation.",
  "frontend/src/components/session/HostSessionSaveLoad.tsx": "Dropdown menu component for session hosts to export/import session data as JSON files, with confirmation dialog for imports and error handling.",
  "frontend/src/components/session/MembersChannelManagementDialogs.tsx": "Handles members' channel CRUD operations (create, rename, delete) using React Query mutations with dialog UI and error state management.",
  "frontend/src/components/session/PlayerDocumentManagementDialogs.tsx": "Provides dialogs and dropdown menu for creating, renaming, deleting, and toggling visibility of player-owned documents within a session. Includes CreatePlayerDocumentDialog and PlayerDocumentMenu components with mutation hooks for document operations.",
  "frontend/src/components/session/PlayerDocumentsDialog.tsx": "Dialog component that lists all player documents in a session, allows selecting a document to open, and provides a button to create new player documents. Displays ownership and privacy status for each document.",
  "frontend/src/components/session/SessionDocumentsDialog.tsx": "Dialog for managing session-wide documents with create, rename, and delete functionality. Lists all session documents with metadata and provides dropdown menus for document actions.",
  "frontend/src/components/session/SessionSidebar.tsx": "Collapsible sidebar for session navigation displaying channels and members channels with create/manage options. Includes quick profile access, UI scale settings, and host-specific controls.",
  "frontend/src/components/settings/PreLobbySettingsView.tsx": "Pre-lobby settings view for configuring theme, background image, default nickname, profile picture, and session template upload/management. Provides UI for user preferences and profile customization before joining sessions.",
  "frontend/src/components/settings/UIScaleSettingsPopover.tsx": "Popover component with slider and input controls for adjusting UI scale from 10% to 200%, with a reset button to restore default 100% scale.",
  "frontend/src/config/polling.ts": "Configuration file defining polling intervals in milliseconds for various data refresh operations including messages, lists, session info, and document content.",
  "frontend/src/context/PreferencesContext.tsx": "React context provider for managing user preferences (theme mode, etc.) with localStorage persistence and automatic dark mode class application to the document element.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor instance with authentication, initializing access control with admin token and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useActorStartupGuard.ts": "Hook that monitors actor initialization with a 15-second timeout, detecting failures or hung connections and providing error state for authenticated users.",
  "frontend/src/hooks/useCommunityImageUpload.ts": "Hook for uploading community images using ExternalBlob with progress tracking, returning the direct URL of uploaded images.",
  "frontend/src/hooks/useDocumentComments.ts": "Provides React Query hooks for CRUD operations on document comments (get, add, delete, update) with automatic cache invalidation and 5-second polling.",
  "frontend/src/hooks/useDocumentFiles.ts": "Provides React Query hooks for managing document file references including listing, retrieving, and uploading files with validation and cache invalidation.",
  "frontend/src/hooks/useDocumentImages.ts": "Provides React Query hooks for managing image references in both session and player documents, including listing and adding images with position and size metadata.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login/logout flow, identity persistence, and delegation validity with configurable AuthClient options.",
  "frontend/src/hooks/useLocalStickers.ts": "Hook for managing local sticker storage with add/remove operations and loading state, using localStorage-based persistence.",
  "frontend/src/hooks/usePlayerDocuments.ts": "Provides React Query hooks for full CRUD operations on player documents including visibility control, with 5-second polling and automatic cache invalidation.",
  "frontend/src/hooks/usePolling.ts": "Generic polling hook that executes a callback at specified intervals with enable/disable control and proper cleanup.",
  "frontend/src/hooks/usePreferences.ts": "Re-exports the usePreferences hook from PreferencesContext for backwards compatibility.",
  "frontend/src/hooks/useQuickChatProfile.ts": "Hook for managing quick chat profile data with localStorage persistence, providing save, clear, and loading state functionality.",
  "frontend/src/hooks/useSessionData.ts": "Provides React Query hooks for fetching session data (session details, channels, members' channels, messages) with polling intervals, and mutations for creating, renaming, and deleting members' channels.",
  "frontend/src/hooks/useSessionDocuments.ts": "Exports React Query hooks for managing session documents including listing, getting, creating, renaming, deleting, and editing documents with automatic cache invalidation.",
  "frontend/src/hooks/useUserDisplayName.ts": "React Query hook that fetches a user's display name from their profile, falling back to a shortened principal string if unavailable.",
  "frontend/src/hooks/useUserProfile.ts": "Provides React Query hooks for fetching and updating user profiles, including getting the caller's profile, getting any user's profile, saving profiles, and removing profile pictures.",
  "frontend/src/hooks/useViewportHeight.ts": "Custom React hook that tracks dynamic viewport height changes for handling mobile keyboard appearance, screen rotation, and other viewport events.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light/dark themes, community hub cosmic theme, and mobile-friendly chat layout styles including message bubbles and scroll containers.",
  "frontend/src/lib/clearLocalAppData.ts": "Utility function that clears specific localStorage keys and sessionStorage for app data cleanup.",
  "frontend/src/lib/colorContrast.ts": "Provides functions to calculate color contrast ratios using relative luminance and validate WCAG AA compliance for text readability.",
  "frontend/src/lib/communityTheme.ts": "Defines community theme types, default theme values, font/background presets, and utilities for applying custom themes to DOM elements.",
  "frontend/src/lib/documentFileMarkers.ts": "Utilities for creating, parsing, inserting, and removing file markers in document content using a `[FILE:id:filename]` format.",
  "frontend/src/lib/documentImageMarkers.ts": "Utilities for creating, parsing, inserting, and removing image markers in document content using an `[IMAGE:id:caption]` format.",
  "frontend/src/lib/documentPreviewMarkup.tsx": "Parses and renders custom markup in document content including file markers, line prefixes (center, big, heading, tiny), inline spoilers, and underlines. Provides tokenization and React components for interactive spoiler text.",
  "frontend/src/lib/gifUrlValidation.ts": "Validates and extracts GIF URLs from text, ensuring URLs are properly formatted and end with .gif extension.",
  "frontend/src/lib/imageValidation.ts": "Validates image files (PNG/JPG, max 5MB), converts files to byte arrays, and creates preview URLs for uploaded images.",
  "frontend/src/lib/myCommunitiesHiddenStorage.ts": "Manages localStorage persistence for hidden community IDs, providing functions to load, save, add, remove, and clear hidden community preferences.",
  "frontend/src/lib/preferencesStorage.ts": "Manages user preferences (theme mode, background image, default nickname, UI scale) in localStorage with validation and default values.",
  "frontend/src/lib/quickChatProfileStorage.ts": "Handles localStorage persistence for quick chat profiles containing display name and avatar data URL, with validation for data URL format and size limits.",
  "frontend/src/lib/rollCommand.ts": "Validates dice roll command patterns (e.g., d20, 2d6+3) by checking for required 'd' character and valid syntax.",
  "frontend/src/lib/sessionExportFile.ts": "Creates, downloads, and parses session export JSON files with versioning, validation, and error handling for import/export functionality.",
  "frontend/src/lib/sessionStorage.ts": "Manages localStorage persistence for active session context including session ID, nickname, and host status.",
  "frontend/src/lib/stickerImageProcessor.ts": "Processes uploaded images into 128x128 PNG stickers with square cropping, size validation (max 200KB), and converts to data URLs and byte arrays.",
  "frontend/src/lib/stickerStorage.ts": "Manages localStorage for user stickers (max 50) with functions to load, save, add, remove, and clear sticker data.",
  "frontend/src/lib/templateHistoryStorage.ts": "Handles localStorage persistence for session templates with validation, save, load, and clear operations for session export data.",
  "frontend/src/lib/time.ts": "Formats bigint nanosecond timestamps into human-readable strings, showing time only for today or date+time for older timestamps.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/CommunitiesHubPage.tsx": "React page component displaying a hub for browsing, creating, and managing communities with tabs for 'My Communities', 'Discover', and 'Chats', including search, filtering, and dialogs for community creation and details.",
  "frontend/src/pages/LobbyPage.tsx": "React page component for hosting or joining sessions with forms for session name, password, and nickname; handles session creation, template application, and navigation to session view.",
  "frontend/src/pages/SessionPage.tsx": "Main session page component managing channel chat views, player/session document editors, and sidebar navigation; handles view switching between channels, documents, and communities hub.",
  "frontend/src/types/community.ts": "TypeScript type definitions for community-related data structures including Community, SubPlace, CommunityTheme, privacy/join types, and form data interfaces.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color tokens using OKLCH color space, extended theme properties, animations, and plugin integrations for typography and container queries.",
  "project_state.json": "Project metadata tracking existing features for GIF URL support in chat, pending backend Message type updates, and overall project state for a community chat application."
}